In [6]:
%%sql 
CREATE TABLE Employee(Id INT(50),Salary INT(50));
INSERT INTO Employee VALUES(1,100);
INSERT INTO Employee VALUES(2,200);
INSERT INTO Employee VALUES(3,300);
SELECT * from Employee;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 100), (2, 200), (3, 300)]

# 176. Second Highest Salary

In [13]:
%%sql
SELECT
    (SELECT DISTINCT Salary
     FROM Employee
     ORDER BY Salary DESC
     LIMIT 1 OFFSET 1) AS SecondHighestSalary;

 * sqlite://
Done.

[(200,)]

# 177. Nth Highest Salary

In [18]:
N = 2

In [21]:
%%sql
SELECT E.Salary
FROM (
  SELECT DISTINCT (CASE WHEN 3 > (SELECT DISTINCT COUNT(*) 
                                  FROM (SELECT DISTINCT Salary FROM Employee) E) 
                   THEN NULL ELSE Salary END) AS Salary
  FROM Employee
  ORDER BY Salary DESC
  LIMIT 3
) E
ORDER BY Salary
LIMIT 1

 * sqlite://
Done.

[(100,)]

# 183. Customers Who Never Order

In [22]:
%%sql 
CREATE TABLE Customers(Id INT(50),Name varchar(255));
INSERT INTO Customers VALUES(1,'Joe');
INSERT INTO Customers VALUES(2,'Henry');
INSERT INTO Customers VALUES(3,'Sam');
INSERT INTO Customers VALUES(4,'Max');
SELECT * from Customers;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'Joe'), (2, 'Henry'), (3, 'Sam'), (4, 'Max')]

In [23]:
%%sql 
CREATE TABLE Orders(Id INT(50),CustomerId INT(50));
INSERT INTO Orders VALUES(1,3);
INSERT INTO Orders VALUES(2,1);
SELECT * from Orders;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
Done.

[(1, 3), (2, 1)]

In [27]:
%%sql 
SELECT C.name as 'Customers'
FROM Customers C
WHERE C.id not in
(SELECT CustomerId FROM Orders);

 * sqlite://
Done.

[('Henry',), ('Max',)]

# 597. Friend Requests I: Overall Acceptance Rate - また

In [28]:
%%sql 
CREATE TABLE friend_request(sender_id INT(50),send_to_id INT(50),request_date DATE);
INSERT INTO friend_request VALUES(1,2,'2016_06-01');
INSERT INTO friend_request VALUES(1,3,'2016_06-01');
INSERT INTO friend_request VALUES(1,4,'2016_06-01');
INSERT INTO friend_request VALUES(2,3,'2016_06-02');
INSERT INTO friend_request VALUES(3,4,'2016_06-09');
SELECT * from friend_request;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 2, '2016_06-01'),
 (1, 3, '2016_06-01'),
 (1, 4, '2016_06-01'),
 (2, 3, '2016_06-02'),
 (3, 4, '2016_06-09')]

In [29]:
%%sql 
CREATE TABLE request_accepted(requester_id INT(50),accepter_id INT(50),accept_date DATE);
INSERT INTO request_accepted VALUES(1,2,'2016_06-03');
INSERT INTO request_accepted VALUES(1,3,'2016_06-08');
INSERT INTO request_accepted VALUES(2,3,'2016_06-08');
INSERT INTO request_accepted VALUES(3,4,'2016_06-09');
INSERT INTO request_accepted VALUES(3,4,'2016_06-10');
SELECT * from request_accepted;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 2, '2016_06-03'),
 (1, 3, '2016_06-08'),
 (2, 3, '2016_06-08'),
 (3, 4, '2016_06-09'),
 (3, 4, '2016_06-10')]

In [44]:
%%sql 
SELECT round(IFNULL(
    (select count(*) from (select distinct requester_id, accepter_id 
                           from request_accepted) as A)/
    (select count(*) from (select distinct sender_id, send_to_id 
                           from friend_request) as B),0), 2) as accept_rate;

 * sqlite://
Done.

[(0.0,)]

# 602. Friend Requests II: Who Has the Most Friends

In [46]:
%%sql 
CREATE TABLE request_accept(requester_id INT(50),accepter_id INT(50),accept_date DATE);
INSERT INTO request_accept VALUES(1,2,'2016_06-03');
INSERT INTO request_accept VALUES(1,3,'2016_06-08');
INSERT INTO request_accept VALUES(2,3,'2016_06-08');
INSERT INTO request_accept VALUES(3,4,'2016_06-09');
SELECT * from request_accept;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 2, '2016_06-03'),
 (1, 3, '2016_06-08'),
 (2, 3, '2016_06-08'),
 (3, 4, '2016_06-09')]

In [48]:
%%sql 

SELECT idx as id, cnt as num
FROM
    (SELECT idx,count(*) as cnt 
     FROM 
         (SELECT requester_id AS idx FROM request_accepted
          UNION ALL
          SELECT accepter_id FROM request_accepted
         ) AS t1
     GROUP BY idx) AS t2
ORDER BY cnt DESC
LIMIT 1;

 * sqlite://
Done.

[(3, 4)]

# 185. Department Top Three Salaries

In [50]:
%%sql 
CREATE TABLE Employe(Id INT(50),Name varchar(255), Salary INT(50),DepartmentId INT(50));
INSERT INTO Employe VALUES(1,'Joe',85000,1);
INSERT INTO Employe VALUES(2,'Henry',80000,2);
INSERT INTO Employe VALUES(3,'Sam',60000,2);
INSERT INTO Employe VALUES(4,'Max',90000,1);
INSERT INTO Employe VALUES(5,'Janet',69000,1);
INSERT INTO Employe VALUES(6,'Randy',85000,1);
INSERT INTO Employe VALUES(7,'Will',70000,1);

SELECT * from Employe;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'Joe', 85000, 1),
 (2, 'Henry', 80000, 2),
 (3, 'Sam', 60000, 2),
 (4, 'Max', 90000, 1),
 (5, 'Janet', 69000, 1),
 (6, 'Randy', 85000, 1),
 (7, 'Will', 70000, 1)]

In [51]:
%%sql 
CREATE TABLE Department(Id INT(50),Name varchar(255));
INSERT INTO Department VALUES(1,'IT');
INSERT INTO Department VALUES(2,'Sales');
SELECT * from Department;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
Done.

[(1, 'IT'), (2, 'Sales')]

In [61]:
%%sql 
SELECT d.Name AS Department, e1.Name AS Employe, e1.Salary
FROM Employe e1
JOIN Department d ON e1.DepartmentId = d.Id
WHERE 3 > (SELECT COUNT(DISTINCT e2.Salary)
        FROM Employe e2
        WHERE e2.Salary > e1.Salary AND e1.DepartmentId = e2.DepartmentId);

 * sqlite://
Done.

[('IT', 'Joe', 85000),
 ('Sales', 'Henry', 80000),
 ('Sales', 'Sam', 60000),
 ('IT', 'Max', 90000),
 ('IT', 'Randy', 85000),
 ('IT', 'Will', 70000)]